# SQL - Python Connection 
- First create profile in mysql
- connect through Python to mySQL to fetch values

## MySQL
- Login to mysql
    - cmd
    - mysql -u root -p (piit2025)
- create database piit
    - create database piit;
- create user piuser
  - create user 'piuser'@'%' identified by 'Pass@123' ;
  - grant all privileges on piit.* to 'piuser'@'%' with grant option ;
  - flush privileges ;
- login as piuser to mysql
    - cmd
    - mysql -u piuser -p (Pass@123)
- use databases piit
    - use piit ;
    - show tables;  (it will be nil  initially)
- create a table employees
    - CREATE TABLE employees (  employee_id INT PRIMARY KEY,   first_name VARCHAR(50),  last_name VARCHAR(50),  department VARCHAR(50),  salary DECIMAL(10, 2))
- add data into this stable
    -  INSERT INTO employees (employee_id, first_name, last_name, department, salary) VALUES   (1, 'John', 'Doe', 'HR', 50000.00),  (2, 'Jane', 'Smith', 'IT', 60000.00),   (3, 'Alice', 'Johnson', 'Finance', 55000.00),  (4, 'Bob', 'Williams', 'IT', 62000.00),   (5, 'Emily', 'Brown', 'HR', 48000.00); 
- check if tables is showing data
    - SELECT * FROM employees;

In [19]:

pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\djedjiga\appdata\roaming\python\python313\site-packages (1.1.2)
Note: you may need to restart the kernel to use updated packages.

In [21]:
pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\lib\site-packages (2.0.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (4.12.2)

In [22]:
import sqlalchemy
print (sqlalchemy.__version__)

2.0.39

In [23]:
# libraries (install if required)
from sqlalchemy import create_engine, text
import pandas as pd
import os

In [24]:
#engine1 = create_engine("mysql+pymysql://piuser:Pass@123@localhost:3306/piit")
#engine1

In [28]:
# URL-encode special chars in password if any (e.g., # -> %23, @ -> %40)  #Pass@123 - Pass%40123
engine1 = create_engine("mysql+pymysql://piuser1:Pass%40123@localhost:3306/piit")
print(engine1)
#setting up connection mysql with user name - piuser, pwd - Pass@123 and to database piit at port no  3306

Engine(mysql+pymysql://piuser1:***@localhost:3306/piit)

In [29]:
# function to run the query with parameters or query
def q(sql, **params):
    with engine1.connect() as conn:
        return pd.read_sql(text(sql), conn, params=params)

In [30]:
q("SELECT * FROM employees")

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0

In [31]:
q('select * from employees where department = "HR"')

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            5      Emily     Brown         HR  48000.0

# this should run successfully
- Now run different queries on the tables

In [32]:
q('select * from employees where salary > 56700')

   employee_id first_name last_name department   salary
0            2       Jane     Smith         IT  60000.0
1            4        Bob  Williams         IT  62000.0

In [35]:
q('select * from employees where last_name = "smith"' )

   employee_id first_name last_name department   salary
0            2       Jane     Smith         IT  60000.0

In [36]:
df2 = pd.read_sql("SELECT * FROM employees", engine1)
df2.shape

(5, 5)

In [37]:
df2.head(2)

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0

In [38]:
df3 = df2.copy()
df3.head()

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0

In [39]:
df3['employee_id'] = df3['employee_id'] + 100
df3

   employee_id first_name last_name department   salary
0          101       John       Doe         HR  50000.0
1          102       Jane     Smith         IT  60000.0
2          103      Alice   Johnson    Finance  55000.0
3          104        Bob  Williams         IT  62000.0
4          105      Emily     Brown         HR  48000.0

In [40]:
df3.to_sql( name='employees', con=engine1, if_exists='append', index=False )

5

In [41]:
df4 = pd.read_sql("SELECT * FROM employees", engine1)
df4

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0
5          101       John       Doe         HR  50000.0
6          102       Jane     Smith         IT  60000.0
7          103      Alice   Johnson    Finance  55000.0
8          104        Bob  Williams         IT  62000.0
9          105      Emily     Brown         HR  48000.0